# Реалізувати функцію eucledian_gcd(a, b), яка обраховуватиме найбільший
# спільний дільник для агрументів a та b за алгоритмом Евкліда.
# Функція має приймати два цілих числа як аргументи,
# і повертати результат обчислення як ціле число.
# Додатковим плюсом буде наявність перевірки типу аргументів:
# якщо аргументи не є цілими числами, виконання переривається з ValueError.
# Алгоритм Евкліда для пошуку НСД:
#      Допоки a != b:
#         - якщо a > b, то a = a - b
#         - якщо b > a, то b = b - a
#     Коли a == b, повертаємо а, яке і буде найбільшим спільним дільником.

def eucledian_gcd(a, b):
    while a != b:
        if a > b:
            a = a - b
        else:
            b = b - a
    print(a)


if __name__ == '__main__':
    print("Enter two integer.")
    a = int(input("First: "))
    b = int(input("Second: "))
    eucledian_gcd(a, b)
